2022.03.29.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2022.03.22.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2022.04.05.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of March 22 to 29, 2022.

#+TOC: headlines 1


* pyml_bindgen: a CLI app to generate Python bindings directly from OCaml value specifications
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-pyml-bindgen-a-cli-app-to-generate-python-bindings-directly-from-ocaml-value-specifications/8786/6

** Ryan Moore announced


*** New releases

Version 0.3.0 and 0.3.1 are now available on [[https://github.com/mooreryan/ocaml_python_bindgen/tags][GitHub]].  0.3.0
has been merged into opam, and a PR for 0.3.1 has been opened.  The [[https://github.com/mooreryan/ocaml_python_bindgen/blob/main/CHANGELOG.md][change
log]] has more details about the changes.

*** Binding tuples

You can now bind tuples directly.  Here's a Python function that takes two lists of points (where each "point" is a
tuple like ~(x, y)~) and adds them together

#+begin_src python
def add(points1, points2):
    return [(x1 + y1, x2 + y2) for (x1, x2), (y1, y2) in zip(points1, points2)]
#+end_src

And you could bind it using tuples from the OCaml side as well.

#+begin_src ocaml
val add : points1:(int * int) list -> points2:(int * int) list -> unit -> (int * int) list
#+end_src

Note there are some restrictions regarding tuples, which you can read about
[[https://mooreryan.github.io/ocaml_python_bindgen/tuples/][here]],
[[https://github.com/mooreryan/ocaml_python_bindgen/blob/main/examples/README.md][here]], or
[[https://github.com/mooreryan/ocaml_python_bindgen/blob/main/CHANGELOG.md#030-2022-03-18][here]].

*** Attributes

You can use attributes on value specifications.  Currently the only one supported is ~py_fun_name~, which allows you
to decouple the Python method name and the generated OCaml function name.

As an example, take the following Python function, which adds to "things".

#+begin_src python
def add(x, y):
    return x + y
#+end_src

You could bind multiple OCaml functions to this single function now.

#+begin_src ocaml
val add_int : x:int -> y:int -> unit -> int
[@@py_fun_name add]

val add_float : x:float -> y:float -> unit -> float
[@@py_fun_name add]

val add_string : x:string -> y:string -> unit -> string
[@@py_fun_name add]
#+end_src

**** Python magic methods

This is also nice for binding Python [[https://docs.python.org/3/reference/datamodel.html#specialnames][magic
methods]]. For example, you don't have to use
~__init__~ as the name of the OCaml function you use to make instances of a Python class.  You can bind it to a more
natural name like ~create~ or ~make~.

#+begin_src ocaml
val create : name:string -> age:int -> unit -> t
[@@py_fun_name __init__]
#+end_src

*** Using Pytypes.pyobject directly

Sometimes you may not want to bother converting Python types to normal OCaml types at all.  You can do that now in
value specifications by using the ~Pytypes.pyobject~ and ~Py.Object.t~ types directly.

