2022.03.29.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-29 Tue 09:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2022.03.22.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2022.04.05.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of March 22 to 29, 2022.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">pyml_bindgen: a CLI app to generate Python bindings directly from OCaml value specifications</a></li>
<li><a href="#2">Tarides is hiring!</a></li>
<li><a href="#3">For Diversity and the OCaml Community: Outreachy Summer 2022</a></li>
<li><a href="#4">Caqti 1.8.0 and related news</a></li>
<li><a href="#5">First release of prbnmcn-dagger</a></li>
<li><a href="#6">MirageOS 4.0</a></li>
<li><a href="#7">OCaml 4.14.0 is released</a></li>
<li><a href="#8">ocaml-in-python.0.1.0: Effortless Python bindings for OCaml modules</a></li>
<li><a href="#orgfc5addb">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">pyml_bindgen: a CLI app to generate Python bindings directly from OCaml value specifications</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-pyml-bindgen-a-cli-app-to-generate-python-bindings-directly-from-ocaml-value-specifications/8786/6">https://discuss.ocaml.org/t/ann-pyml-bindgen-a-cli-app-to-generate-python-bindings-directly-from-ocaml-value-specifications/8786/6</a>
</p>
</div>

<div id="outline-container-org61fded5" class="outline-3">
<h3 id="org61fded5">Ryan Moore announced</h3>
<div class="outline-text-3" id="text-org61fded5">
</div>
<div id="outline-container-org1b4a8ae" class="outline-4">
<h4 id="org1b4a8ae">New releases</h4>
<div class="outline-text-4" id="text-org1b4a8ae">
<p>
Version 0.3.0 and 0.3.1 are now available on <a href="https://github.com/mooreryan/ocaml_python_bindgen/tags">GitHub</a>.  0.3.0
has been merged into opam, and a PR for 0.3.1 has been opened.  The <a href="https://github.com/mooreryan/ocaml_python_bindgen/blob/main/CHANGELOG.md">change
log</a> has more details about the changes.
</p>
</div>
</div>

<div id="outline-container-orgcc21b2e" class="outline-4">
<h4 id="orgcc21b2e">Binding tuples</h4>
<div class="outline-text-4" id="text-orgcc21b2e">
<p>
You can now bind tuples directly.  Here's a Python function that takes two lists of points (where each "point" is a
tuple like <code>(x, y)</code>) and adds them together
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">add</span>(points1, points2):
    <span style="color: #a020f0;">return</span> [(x1 + y1, x2 + y2) <span style="color: #a020f0;">for</span> (x1, x2), (y1, y2) <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">zip</span>(points1, points2)]
</pre>
</div>

<p>
And you could bind it using tuples from the OCaml side as well.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">add</span> : <span style="color: #008b8b;">points1</span>:(int * int) list -&gt; <span style="color: #008b8b;">points2</span>:(int * int) list -&gt; unit -&gt; (int * int) list
</pre>
</div>

<p>
Note there are some restrictions regarding tuples, which you can read about
<a href="https://mooreryan.github.io/ocaml_python_bindgen/tuples/">here</a>,
<a href="https://github.com/mooreryan/ocaml_python_bindgen/blob/main/examples/README.md">here</a>, or
<a href="https://github.com/mooreryan/ocaml_python_bindgen/blob/main/CHANGELOG.md#030-2022-03-18">here</a>.
</p>
</div>
</div>

<div id="outline-container-org428ada7" class="outline-4">
<h4 id="org428ada7">Attributes</h4>
<div class="outline-text-4" id="text-org428ada7">
<p>
You can use attributes on value specifications.  Currently the only one supported is <code>py_fun_name</code>, which allows you
to decouple the Python method name and the generated OCaml function name.
</p>

<p>
As an example, take the following Python function, which adds to "things".
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">add</span>(x, y):
    <span style="color: #a020f0;">return</span> x + y
</pre>
</div>

<p>
You could bind multiple OCaml functions to this single function now.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">add_int</span> : <span style="color: #008b8b;">x</span>:int -&gt; <span style="color: #008b8b;">y</span>:int -&gt; unit -&gt; int
<span style="color: #483d8b;">[@@py_fun_name add]</span>

<span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">add_float</span> : <span style="color: #008b8b;">x</span>:float -&gt; <span style="color: #008b8b;">y</span>:float -&gt; unit -&gt; float
<span style="color: #483d8b;">[@@py_fun_name add]</span>

<span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">add_string</span> : <span style="color: #008b8b;">x</span>:string -&gt; <span style="color: #008b8b;">y</span>:string -&gt; unit -&gt; string
<span style="color: #483d8b;">[@@py_fun_name add]</span>
</pre>
</div>
</div>

<div id="outline-container-orge868446" class="outline-5">
<h5 id="orge868446">Python magic methods</h5>
<div class="outline-text-5" id="text-orge868446">
<p>
This is also nice for binding Python <a href="https://docs.python.org/3/reference/datamodel.html#specialnames">magic
methods</a>. For example, you don't have to use
<code>__init__</code> as the name of the OCaml function you use to make instances of a Python class.  You can bind it to a more
natural name like <code>create</code> or <code>make</code>.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">create</span> : <span style="color: #008b8b;">name</span>:string -&gt; <span style="color: #008b8b;">age</span>:int -&gt; unit -&gt; t
<span style="color: #483d8b;">[@@py_fun_name __init__]</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org17aede6" class="outline-4">
<h4 id="org17aede6">Using Pytypes.pyobject directly</h4>
<div class="outline-text-4" id="text-org17aede6">
<p>
Sometimes you may not want to bother converting Python types to normal OCaml types at all.  You can do that now in
value specifications by using the <code>Pytypes.pyobject</code> and <code>Py.Object.t</code> types directly.
</p>
</div>
</div>
