2022.03.29.org
*** Fewer dependencies

~re~ is now used instead of ~re2~, which drops the number of dependencies that need to be installed by about half.
Additionally, ~core~, ~core_bench~, and ~bisect_ppx~ don't need to be installed if you want to install ~pyml_bindgen~
directly from the git repository, which greatly cuts the required dependencies in this case.

Thanks again to UnixJunkie for spurring many of these updates!
      



* Tarides is hiring!
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/tarides-is-hiring/9553/1

** Thomas Gazagnaire announced


Following the recent announcement about Tarides (joining forces with [[https://tarides.com/blog/2022-01-27-ocaml-labs-joins-tarides][OCaml
Labs]] and [[https://tarides.com/blog/2022-03-01-segfault-systems-joins-tarides][Segfault
System]]), we are now looking to expand our team
with experienced software engineers, compassionate team leads and experts in software consulting services. Our
ambition is to bring OCaml to a vast set of new developers and industries. We want to make developers more productive
by spending less time on fixing bugs and more on writing new features. And we want the software industry to build
more robust and performant systems that can last for decades.

We are looking for:

- Experienced [[https://tarides.com/jobs/senior-software-engineer][Software Engineer(s)]] to take part in the development of Irmin. You will be part of the team that designs, builds and ships Irmin libraries and applications to our community and customers.
- [[https://tarides.com/jobs/team-lead-engineering][Team Lead(s)]] who cares about motivating their team members, supporting their growth and development and successfully delivering the team's objectives on time.
- A [[https://tarides.com/jobs/head-of-consulting-services][Head of Consulting Services]] to diversify our technical teams and commercial services portfolio. You'll be the first hire for this brand new department and will have the opportunity to help us build our services structure from scratch, including our strategy, processes, tools, and team.

We are always looking for great OCaml enthusiasts to join our team, so even if these job descriptions do not fit your
profile precisely, you are welcome to send us [[https://tarides.com/jobs/spontaneous-application][a spontaneous
application]]!
      



* For Diversity and the OCaml Community: Outreachy Summer 2022
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/for-diversity-and-the-ocaml-community-outreachy-summer-2022/9234/6

** Deep in this thread, Aya announced


@pitag and I have resubmitted the PPX derivers project for this Summer 2022 round: *Expand OCaml's library of
standard derivers*! This is the same project I was the intern for this past Winter 2022 round, where the goal is to
build up a [[https://github.com/ocaml-ppx/standard_derivers][standard derivers]] library, like ~ppx_deriving~, using
the updated ~ppxlib~ API.

I'm excited to be supporting @pitag with mentoring, and for the opportunity to stay involved now that my internship
has ended :smiley:
      



* Caqti 1.8.0 and related news
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-caqti-1-8-0-and-related-news/9561/1

** "Petter A. Urkedal announced


I am happy to announce the second release of [[https://github.com/paurkedal/ocaml-caqti][Caqti]] this year. The reason
for the quick succession is partly an adjustment to the [[https://paurkedal.github.io/ocaml-caqti/caqti/Caqti_request/Infix/index.html][new API for request
construction]] and partly that
[[https://github.com/paurkedal/ocaml-caqti/issues/72][matchable error conditions]] did not make it into the previous
release.  You can see the full release notes below.

I would also like to thank [[https://ocaml-sf.org][OCaml Software Foundation]] for sponsoring my efforts on the Caqti
project this year, also including most of the work that went into the previous release.

One [[https://github.com/paurkedal/ocaml-caqti/issues/38][feature in progress]] is a new driver based on the pure-OCaml
[[https://github.com/arenadotio/pgx][pgx]] which should make it possible, with some additional changes to the way
drivers are loaded, to target MirageOS. I am note sure if this can be done in a minor release or will require a Caqti
2 branch.

