2022.03.29.html

<div id="outline-container-org2424b3e" class="outline-4">
<h4 id="org2424b3e">Fewer dependencies</h4>
<div class="outline-text-4" id="text-org2424b3e">
<p>
<code>re</code> is now used instead of <code>re2</code>, which drops the number of dependencies that need to be installed by about half.
Additionally, <code>core</code>, <code>core_bench</code>, and <code>bisect_ppx</code> don't need to be installed if you want to install <code>pyml_bindgen</code>
directly from the git repository, which greatly cuts the required dependencies in this case.
</p>

<p>
Thanks again to UnixJunkie for spurring many of these updates!
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Tarides is hiring!</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/tarides-is-hiring/9553/1">https://discuss.ocaml.org/t/tarides-is-hiring/9553/1</a>
</p>
</div>

<div id="outline-container-org5e1f454" class="outline-3">
<h3 id="org5e1f454">Thomas Gazagnaire announced</h3>
<div class="outline-text-3" id="text-org5e1f454">
<p>
Following the recent announcement about Tarides (joining forces with <a href="https://tarides.com/blog/2022-01-27-ocaml-labs-joins-tarides">OCaml
Labs</a> and <a href="https://tarides.com/blog/2022-03-01-segfault-systems-joins-tarides">Segfault
System</a>), we are now looking to expand our team
with experienced software engineers, compassionate team leads and experts in software consulting services. Our
ambition is to bring OCaml to a vast set of new developers and industries. We want to make developers more productive
by spending less time on fixing bugs and more on writing new features. And we want the software industry to build
more robust and performant systems that can last for decades.
</p>

<p>
We are looking for:
</p>

<ul class="org-ul">
<li>Experienced <a href="https://tarides.com/jobs/senior-software-engineer">Software Engineer(s)</a> to take part in the development of Irmin. You will be part of the team that designs, builds and ships Irmin libraries and applications to our community and customers.</li>
<li><a href="https://tarides.com/jobs/team-lead-engineering">Team Lead(s)</a> who cares about motivating their team members, supporting their growth and development and successfully delivering the team's objectives on time.</li>
<li>A <a href="https://tarides.com/jobs/head-of-consulting-services">Head of Consulting Services</a> to diversify our technical teams and commercial services portfolio. You'll be the first hire for this brand new department and will have the opportunity to help us build our services structure from scratch, including our strategy, processes, tools, and team.</li>
</ul>

<p>
We are always looking for great OCaml enthusiasts to join our team, so even if these job descriptions do not fit your
profile precisely, you are welcome to send us <a href="https://tarides.com/jobs/spontaneous-application">a spontaneous
application</a>!
</p>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">For Diversity and the OCaml Community: Outreachy Summer 2022</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/for-diversity-and-the-ocaml-community-outreachy-summer-2022/9234/6">https://discuss.ocaml.org/t/for-diversity-and-the-ocaml-community-outreachy-summer-2022/9234/6</a>
</p>
</div>

<div id="outline-container-orgdd37de3" class="outline-3">
<h3 id="orgdd37de3">Deep in this thread, Aya announced</h3>
<div class="outline-text-3" id="text-orgdd37de3">
<p>
@pitag and I have resubmitted the PPX derivers project for this Summer 2022 round: <b>Expand OCaml's library of
standard derivers</b>! This is the same project I was the intern for this past Winter 2022 round, where the goal is to
build up a <a href="https://github.com/ocaml-ppx/standard_derivers">standard derivers</a> library, like <code>ppx_deriving</code>, using
the updated <code>ppxlib</code> API.
</p>

<p>
I'm excited to be supporting @pitag with mentoring, and for the opportunity to stay involved now that my internship
has ended :smiley:
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">Caqti 1.8.0 and related news</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-caqti-1-8-0-and-related-news/9561/1">https://discuss.ocaml.org/t/ann-caqti-1-8-0-and-related-news/9561/1</a>
</p>
</div>

<div id="outline-container-org8bd699e" class="outline-3">
<h3 id="org8bd699e">"Petter A. Urkedal announced</h3>
<div class="outline-text-3" id="text-org8bd699e">
<p>
I am happy to announce the second release of <a href="https://github.com/paurkedal/ocaml-caqti">Caqti</a> this year. The reason
for the quick succession is partly an adjustment to the <a href="https://paurkedal.github.io/ocaml-caqti/caqti/Caqti_request/Infix/index.html">new API for request
construction</a> and partly that
<a href="https://github.com/paurkedal/ocaml-caqti/issues/72">matchable error conditions</a> did not make it into the previous
release.  You can see the full release notes below.
</p>

<p>
I would also like to thank <a href="https://ocaml-sf.org">OCaml Software Foundation</a> for sponsoring my efforts on the Caqti
project this year, also including most of the work that went into the previous release.
</p>

<p>
One <a href="https://github.com/paurkedal/ocaml-caqti/issues/38">feature in progress</a> is a new driver based on the pure-OCaml
<a href="https://github.com/arenadotio/pgx">pgx</a> which should make it possible, with some additional changes to the way
drivers are loaded, to target MirageOS. I am note sure if this can be done in a minor release or will require a Caqti
2 branch.
</p>
</div>
