2022.03.29.org
*** Release Notes

New features:

  - A matchable representation of common causes of errors on the database
    side is now available, with limitations.  It focuses on conditions which
    seem most likely useful to handle.  At the moment we lack extended error
    codes from SQLite3 needed to make the cause fully precise.

  - Expose the underlying error details from database client libraries.
    This is meant to be use as a last resort, and requires directly linking
    with the relevant drivers.

  - A second set of request construction operators ~->.~, ~->?~, ~->!~, and
    ~->*~ were introduced after experience with converting existing code.
    Given the parameter and result type they return a function which
    constructs a request directly from a query string.  Avoiding the need to
    compose with ~@:-~ simplifies local opens and usage with ~List.map~ etc.

  - Environment variables are now expanded in the debug log when using the
    new request constructors introduced in 1.7.0.

  - A new ~?tweaks_version~ connection parameter has been added to control
    when the client is ready to adapt to changes in database session
    parameters or other adjustments of the interaction with specific
    database systems. [[[https://paurkedal.github.io/ocaml-caqti/caqti/tweaks.html][More details available in the documentation.]]]

  - Enable foreign key constraint checks for SQLite3 starting at tweaks
    version 1.7.

Fixes:

  - Fixed debug logging to pass the correct driver info to the query
    callback instead of a dummy driver info which would cause a failure if
    unsupported.

Deprecations:

  - The ~-->~ operator was renamed to ~-->!~, with a deprecated alias, for
    consistency with the new ~->!~ operator.

  - The old convenience interface for creating requests has been deprecated
    in favour of the new infix operators and the new query template parser.

  - Documented-only deprecations of ~Caqti_sql_io~, ~Caqti_lwt_sql_io~, and
    ~Caqti_async_sql_io~ have been annotated.
      



* First release of prbnmcn-dagger
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ann-first-release-of-prbnmcn-dagger/9311/2

** Igarnier announced


I'm proud to announce the release of version 0.0.2 of [[https://github.com/igarnier/prbnmcn-dagger][prbnmcn-dagger]].

This version adds Sequential Monte-Carlo, a.k.a. [[https://en.wikipedia.org/wiki/Particle_filter][particle
filters]]-based inference to the library.

Here's the full changelog:
- Dependency: ~prbnmcn-stats.0.0.3~ -> ~prbnmcn-stats.0.0.4~
- Add beta distribution to Gsl samplers
- Refactor Cps monad
- Add SMC inference
- Simplify handler type, modularize effect definitions away from Cps_monad
- Fix typo: bernouilli -> bernoulli (report by @nilsbecker)

I also wrote the following article: [[http://probanomicon.xyz/blog/wind_power_forecast.html][Applying Sequential Monte-Carlo to time series
forecasting]]
It contains some use cases for the library, I hope some find it fun :)

To conclude this post, and as a partial answer to @gasche 's
[[https://discuss.ocaml.org/t/multi-shot-continuations-gone-forever/9072/5][question]] in an older thread, I believe
that unlike some other inference techniques, single-shot continuations are enough to implement SMC. Without getting
into the details, the implementation is very reminiscent of that of lightweight threading libraries. I look forward
to experiment with a fibre-based implementation!
      



* MirageOS 4.0
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/ann-mirageos-4-0/9598/1

