2022.03.29.html

<div id="outline-container-org01e31aa" class="outline-4">
<h4 id="org01e31aa">Release Notes</h4>
<div class="outline-text-4" id="text-org01e31aa">
<p>
New features:
</p>

<ul class="org-ul">
<li>A matchable representation of common causes of errors on the database
side is now available, with limitations.  It focuses on conditions which
seem most likely useful to handle.  At the moment we lack extended error
codes from SQLite3 needed to make the cause fully precise.</li>

<li>Expose the underlying error details from database client libraries.
This is meant to be use as a last resort, and requires directly linking
with the relevant drivers.</li>

<li>A second set of request construction operators <code>-&gt;.</code>, <code>-&gt;?</code>, <code>-&gt;!</code>, and
<code>-&gt;*</code> were introduced after experience with converting existing code.
Given the parameter and result type they return a function which
constructs a request directly from a query string.  Avoiding the need to
compose with <code>@:-</code> simplifies local opens and usage with <code>List.map</code> etc.</li>

<li>Environment variables are now expanded in the debug log when using the
new request constructors introduced in 1.7.0.</li>

<li>A new <code>?tweaks_version</code> connection parameter has been added to control
when the client is ready to adapt to changes in database session
parameters or other adjustments of the interaction with specific
database systems. [<a href="https://paurkedal.github.io/ocaml-caqti/caqti/tweaks.html">More details available in the documentation.</a>]</li>

<li>Enable foreign key constraint checks for SQLite3 starting at tweaks
version 1.7.</li>
</ul>

<p>
Fixes:
</p>

<ul class="org-ul">
<li>Fixed debug logging to pass the correct driver info to the query
callback instead of a dummy driver info which would cause a failure if
unsupported.</li>
</ul>

<p>
Deprecations:
</p>

<ul class="org-ul">
<li>The <code>--&gt;</code> operator was renamed to <code>--&gt;!</code>, with a deprecated alias, for
consistency with the new <code>-&gt;!</code> operator.</li>

<li>The old convenience interface for creating requests has been deprecated
in favour of the new infix operators and the new query template parser.</li>

<li>Documented-only deprecations of <code>Caqti_sql_io</code>, <code>Caqti_lwt_sql_io</code>, and
<code>Caqti_async_sql_io</code> have been annotated.</li>
</ul>
</div>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">First release of prbnmcn-dagger</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-first-release-of-prbnmcn-dagger/9311/2">https://discuss.ocaml.org/t/ann-first-release-of-prbnmcn-dagger/9311/2</a>
</p>
</div>

<div id="outline-container-org9fe2c67" class="outline-3">
<h3 id="org9fe2c67">Igarnier announced</h3>
<div class="outline-text-3" id="text-org9fe2c67">
<p>
I'm proud to announce the release of version 0.0.2 of <a href="https://github.com/igarnier/prbnmcn-dagger">prbnmcn-dagger</a>.
</p>

<p>
This version adds Sequential Monte-Carlo, a.k.a. <a href="https://en.wikipedia.org/wiki/Particle_filter">particle
filters</a>-based inference to the library.
</p>

<p>
Here's the full changelog:
</p>
<ul class="org-ul">
<li>Dependency: <code>prbnmcn-stats.0.0.3</code> -&gt; <code>prbnmcn-stats.0.0.4</code></li>
<li>Add beta distribution to Gsl samplers</li>
<li>Refactor Cps monad</li>
<li>Add SMC inference</li>
<li>Simplify handler type, modularize effect definitions away from Cps_monad</li>
<li>Fix typo: bernouilli -&gt; bernoulli (report by @nilsbecker)</li>
</ul>

<p>
I also wrote the following article: <a href="http://probanomicon.xyz/blog/wind_power_forecast.html">Applying Sequential Monte-Carlo to time series
forecasting</a>
It contains some use cases for the library, I hope some find it fun :)
</p>

<p>
To conclude this post, and as a partial answer to @gasche 's
<a href="https://discuss.ocaml.org/t/multi-shot-continuations-gone-forever/9072/5">question</a> in an older thread, I believe
that unlike some other inference techniques, single-shot continuations are enough to implement SMC. Without getting
into the details, the implementation is very reminiscent of that of lightweight threading libraries. I look forward
to experiment with a fibre-based implementation!
</p>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">MirageOS 4.0</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-mirageos-4-0/9598/1">https://discuss.ocaml.org/t/ann-mirageos-4-0/9598/1</a>
</p>
</div>
