2022.03.29.org
** Thomas Gazagnaire announced


*On behalf of the MirageOS team, I am delighted to announce the release of MirageOS 4.0.0!* I'd like to send
special thanks to @dinosaure and @Lortex who drove that release forward for multiple years.

Since the first release of 2013, MirageOS has made steady progress toward deploying a self-managed internet
infrastructure. The project’s initial aim was to self-host as many services as possible
aimed at empowering internet users to securely deploy infrastructure to own their data and take back control of their
privacy. MirageOS can securely deploy [[https://github.com/roburio/unipi][static website hosting]] with “Let’s Encrypt”
certificate provisioning and a [[https://github.com/mirage/ptt][secure SMTPstack]] with security extensions. MirageOS
can also deploy decentralised communication infrastructure like [[https://github.com/mirage/ocaml-matrix][Matrix]],
[[https://github.com/roburio/openvpn][OpenVPN servers]], and [[https://github.com/roburio/tlstunnel][TLS tunnels]] to
ensure data privacy or [[https://github.com/mirage/ocaml-dns][DNS(SEC) servers]] for better authentication.

The protocol ecosystem now contains [[https://github.com/mirage/][hundreds of libraries]] and services
millions of daily users. Over these years, major commercial users have joined the projects. They rely on MirageOS
libraries to keep their products secure. For instance, the MirageOS networking code powers
[[https://www.docker.com/blog/how-docker-desktop-networking-works-under-the-hood/][Docker Desktop’s VPNKit]], which
serves the traffic of millions of containers daily. [[https://www.citrix.com/fr-fr/products/citrix-hypervisor/][Citrix
Hypervisor]] uses MirageOS to interact with Xen, the
hypervisor that powers most of today’s public cloud. [[https://www.nitrokey.com/products/nethsm][Nitrokey]] is
developing a new hardware security module based on MirageOS. [[https://robur.io/][Robur]] develops a unikernel
orchestration system for fleets of MirageOS unikernels. [[https://tarides.com/][Tarides]] uses MirageOS to improve the
[[https://tezos.com/][Tezos]] blockchain, and [[https://hyper.ag/][Hyper]] uses MirageOS to build sensor analytics and an
automation platform for sustainable agriculture.

In the coming weeks, our blog will feature in-depth technical content for the new features that MirageOS brings, as
well as a tour of the existing community and commercial users of MirageOS. Please reach out if you’d like to tell us
about your story.

*** Install MirageOS 4

The easiest way to install MirageOS 4 is by using the opam version 2.1 and `ocaml>=4.12.1`. Follow the [[https://mirage.io/docs/install][installation
guide]] for more details.

#+begin_example
$ opam update
$ opam install 'mirage>4'
#+end_example

/Note/: if you upgrade from MirageOS 3 you will need to manually clean the previous generated files (or call ~mirage
clean~ before upgrading). You would also want to read [[https://mirage.io/docs/breaking-changes][the full list of API
changes]].  You can see unikernel examples in
[[https://github.com/mirage/mirage-skeleton][mirage/mirage-skeleton]],
[[https://github.com/roburio/unikernels][roburio/unikernels]] or
[[https://github.com/tarides/unikernels][tarides/unikernels]].

*** About MirageOS

MirageOS is a library operating system that constructs unikernels for secure, high-performance, low-energy footprint
applications across various hypervisor and embedded platforms. It is available as an
open-source project created and maintained by the [[https://github.com/orgs/mirage/teams/core/members][MirageOS Core
Team]]. A unikernel can be customised based on the target
architecture by picking the relevant MirageOS libraries and compiling them into a standalone operating system, which
contains strictly the functionality necessary for the target. This minimises the unikernel’s footprint, increasing
the security of the deployed operating system.

The MirageOS architecture can be divided into operating system libraries, typed signatures, and a metaprogramming
compiler. The operating system libraries implement various functionalities, ranging
from low-level network card drivers, to full reimplementations of the TLS protocol, as well as the Git protocol to
store versioned data. A set of typed signatures ensures that the OS libraries are consistent
and work well in conjunction with each other. Most importantly, MirageOS is also a metaprogramming compiler that can
input OCaml source code along with its dependencies, and a deployment target
description in order to generate an executable unikernel, i.e., a specialised binary artefact containing only the
code needed to run on the target platform. Overall, MirageOS focuses on providing a small, well-defined, typed
interface with the system components of the target architecture.

Read the full announcement on [[https://mirage.io/blog/announcing-mirage-40][mirage.io's blog]].
      

