2022.03.29.html

<div id="outline-container-orgcafd8ed" class="outline-3">
<h3 id="orgcafd8ed">Thomas Gazagnaire announced</h3>
<div class="outline-text-3" id="text-orgcafd8ed">
<p>
<b>On behalf of the MirageOS team, I am delighted to announce the release of MirageOS 4.0.0!</b> I'd like to send
special thanks to @dinosaure and @Lortex who drove that release forward for multiple years.
</p>

<p>
Since the first release of 2013, MirageOS has made steady progress toward deploying a self-managed internet
infrastructure. The project’s initial aim was to self-host as many services as possible
aimed at empowering internet users to securely deploy infrastructure to own their data and take back control of their
privacy. MirageOS can securely deploy <a href="https://github.com/roburio/unipi">static website hosting</a> with “Let’s Encrypt”
certificate provisioning and a <a href="https://github.com/mirage/ptt">secure SMTPstack</a> with security extensions. MirageOS
can also deploy decentralised communication infrastructure like <a href="https://github.com/mirage/ocaml-matrix">Matrix</a>,
<a href="https://github.com/roburio/openvpn">OpenVPN servers</a>, and <a href="https://github.com/roburio/tlstunnel">TLS tunnels</a> to
ensure data privacy or <a href="https://github.com/mirage/ocaml-dns">DNS(SEC) servers</a> for better authentication.
</p>

<p>
The protocol ecosystem now contains <a href="https://github.com/mirage/">hundreds of libraries</a> and services
millions of daily users. Over these years, major commercial users have joined the projects. They rely on MirageOS
libraries to keep their products secure. For instance, the MirageOS networking code powers
<a href="https://www.docker.com/blog/how-docker-desktop-networking-works-under-the-hood/">Docker Desktop’s VPNKit</a>, which
serves the traffic of millions of containers daily. <a href="https://www.citrix.com/fr-fr/products/citrix-hypervisor/">Citrix
Hypervisor</a> uses MirageOS to interact with Xen, the
hypervisor that powers most of today’s public cloud. <a href="https://www.nitrokey.com/products/nethsm">Nitrokey</a> is
developing a new hardware security module based on MirageOS. <a href="https://robur.io/">Robur</a> develops a unikernel
orchestration system for fleets of MirageOS unikernels. <a href="https://tarides.com/">Tarides</a> uses MirageOS to improve the
<a href="https://tezos.com/">Tezos</a> blockchain, and <a href="https://hyper.ag/">Hyper</a> uses MirageOS to build sensor analytics and an
automation platform for sustainable agriculture.
</p>

<p>
In the coming weeks, our blog will feature in-depth technical content for the new features that MirageOS brings, as
well as a tour of the existing community and commercial users of MirageOS. Please reach out if you’d like to tell us
about your story.
</p>
</div>

<div id="outline-container-org2d7fef3" class="outline-4">
<h4 id="org2d7fef3">Install MirageOS 4</h4>
<div class="outline-text-4" id="text-org2d7fef3">
<p>
The easiest way to install MirageOS 4 is by using the opam version 2.1 and `ocaml&gt;=4.12.1`. Follow the <a href="https://mirage.io/docs/install">installation
guide</a> for more details.
</p>

<pre class="example" id="org01e04c7">
$ opam update
$ opam install 'mirage&gt;4'
</pre>

<p>
<i>Note</i>: if you upgrade from MirageOS 3 you will need to manually clean the previous generated files (or call <code>mirage
clean</code> before upgrading). You would also want to read <a href="https://mirage.io/docs/breaking-changes">the full list of API
changes</a>.  You can see unikernel examples in
<a href="https://github.com/mirage/mirage-skeleton">mirage/mirage-skeleton</a>,
<a href="https://github.com/roburio/unikernels">roburio/unikernels</a> or
<a href="https://github.com/tarides/unikernels">tarides/unikernels</a>.
</p>
</div>
</div>

<div id="outline-container-orgc806b6b" class="outline-4">
<h4 id="orgc806b6b">About MirageOS</h4>
<div class="outline-text-4" id="text-orgc806b6b">
<p>
MirageOS is a library operating system that constructs unikernels for secure, high-performance, low-energy footprint
applications across various hypervisor and embedded platforms. It is available as an
open-source project created and maintained by the <a href="https://github.com/orgs/mirage/teams/core/members">MirageOS Core
Team</a>. A unikernel can be customised based on the target
architecture by picking the relevant MirageOS libraries and compiling them into a standalone operating system, which
contains strictly the functionality necessary for the target. This minimises the unikernel’s footprint, increasing
the security of the deployed operating system.
</p>

<p>
The MirageOS architecture can be divided into operating system libraries, typed signatures, and a metaprogramming
compiler. The operating system libraries implement various functionalities, ranging
from low-level network card drivers, to full reimplementations of the TLS protocol, as well as the Git protocol to
store versioned data. A set of typed signatures ensures that the OS libraries are consistent
and work well in conjunction with each other. Most importantly, MirageOS is also a metaprogramming compiler that can
input OCaml source code along with its dependencies, and a deployment target
description in order to generate an executable unikernel, i.e., a specialised binary artefact containing only the
code needed to run on the target platform. Overall, MirageOS focuses on providing a small, well-defined, typed
interface with the system components of the target architecture.
</p>

<p>
Read the full announcement on <a href="https://mirage.io/blog/announcing-mirage-40">mirage.io's blog</a>.
</p>
</div>
</div>
</div>
