2022.03.29.org
** Anil Madhavapeddy then added


For those curious about what some of the MirageOS libraries _are_, there is a raw Yaml list over at
[[https://github.com/mirage/mirage-repositories/blob/main/repos.yml][mirage/mirage-repositories]] listing most of them.
Conversion of this Yaml to HTML for the main mirage.io website would be a welcome contribution! :slight_smile:
      



* OCaml 4.14.0 is released
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ocaml-4-14-0-is-released/9600/1

** octachron announced


The OCaml team has the pleasure of celebrating the birthday of Alexander Grothendieck by
announcing the release of OCaml version 4.14.0.

Some of the highlights in the 4.14.0 release are:

- Integrated support for "go to definitions" in Merlin.
- Standard library: new modules ~In_channel~ and ~Out_channel~,
  many new functions in Seq module, UTF decoding and validation support
  for strings and bytes.
- Runtime optimisation: GC prefetching. Benchmarks show a speedup of around 20%
  in GC-heavy programs.
- Improved error messages in particular for module-level error.
- Deprecated functions and modules in preparation for OCaml 5.
  In particular, the Stream and Genlex modules are now deprecated.
- Type variables can be explicitly introduced in value and variant constructor
  declarations. For instance,
  #+begin_src ocaml
     val fold: ('acc -> 'elt -> 'acc) -> 'acc -> 'elt list -> 'acc
     type showable = Show: 'a * ('a -> string) -> showable
  #+end_src
  can now be written as
  #+begin_src ocaml
    val fold: 'acc 'elt. ('acc -> 'elt -> 'acc) -> 'acc -> 'elt list -> 'acc
    type showable = Show: 'a. 'a * ('a -> string) -> showable
  #+end_src
- Tail-call with up to 64 arguments are now guaranteed to be optimized
  for all architectures.
- Experimental tail modulo cons (TMC) transformation

The full list of changes can be found in the changelog below. (/editor’s note: please follow the archive link for the full changelog/)

Those releases are available as OPAM switches, and as a source download here:

- https://github.com/ocaml/ocaml/archive/4.14.0.tar.gz
- https://caml.inria.fr/pub/distrib/ocaml-4.14/ocaml-4.14.0.tar.gz
      



* ocaml-in-python.0.1.0: Effortless Python bindings for OCaml modules
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/ann-ocaml-in-python-0-1-0-effortless-python-bindings-for-ocaml-modules/9603/1

