2022.03.29.html


<div id="outline-container-org0eb30e5" class="outline-3">
<h3 id="org0eb30e5">Anil Madhavapeddy then added</h3>
<div class="outline-text-3" id="text-org0eb30e5">
<p>
For those curious about what some of the MirageOS libraries <span class="underline">are</span>, there is a raw Yaml list over at
<a href="https://github.com/mirage/mirage-repositories/blob/main/repos.yml">mirage/mirage-repositories</a> listing most of them.
Conversion of this Yaml to HTML for the main mirage.io website would be a welcome contribution! :slight_smile:
</p>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">OCaml 4.14.0 is released</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-4-14-0-is-released/9600/1">https://discuss.ocaml.org/t/ocaml-4-14-0-is-released/9600/1</a>
</p>
</div>

<div id="outline-container-org622d857" class="outline-3">
<h3 id="org622d857">octachron announced</h3>
<div class="outline-text-3" id="text-org622d857">
<p>
The OCaml team has the pleasure of celebrating the birthday of Alexander Grothendieck by
announcing the release of OCaml version 4.14.0.
</p>

<p>
Some of the highlights in the 4.14.0 release are:
</p>

<ul class="org-ul">
<li>Integrated support for "go to definitions" in Merlin.</li>
<li>Standard library: new modules <code>In_channel</code> and <code>Out_channel</code>,
many new functions in Seq module, UTF decoding and validation support
for strings and bytes.</li>
<li>Runtime optimisation: GC prefetching. Benchmarks show a speedup of around 20%
in GC-heavy programs.</li>
<li>Improved error messages in particular for module-level error.</li>
<li>Deprecated functions and modules in preparation for OCaml 5.
In particular, the Stream and Genlex modules are now deprecated.</li>
<li><p>
Type variables can be explicitly introduced in value and variant constructor
declarations. For instance,
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">fold</span>: ('acc -&gt; 'elt -&gt; 'acc) -&gt; 'acc -&gt; 'elt list -&gt; 'acc
<span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">showable</span> = <span style="color: #000000; background-color: #ffffff;">Show</span>: 'a * ('a -&gt; string) -&gt; showable
</pre>
</div>
<p>
can now be written as
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">fold</span>: 'acc 'elt. ('acc -&gt; 'elt -&gt; 'acc) -&gt; 'acc -&gt; 'elt list -&gt; 'acc
<span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">showable</span> = <span style="color: #000000; background-color: #ffffff;">Show</span>: 'a. 'a * ('a -&gt; string) -&gt; showable
</pre>
</div></li>
<li>Tail-call with up to 64 arguments are now guaranteed to be optimized
for all architectures.</li>
<li>Experimental tail modulo cons (TMC) transformation</li>
</ul>

<p>
The full list of changes can be found in the changelog below. (<i>editor’s note: please follow the archive link for the full changelog</i>)
</p>

<p>
Those releases are available as OPAM switches, and as a source download here:
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/archive/4.14.0.tar.gz">https://github.com/ocaml/ocaml/archive/4.14.0.tar.gz</a></li>
<li><a href="https://caml.inria.fr/pub/distrib/ocaml-4.14/ocaml-4.14.0.tar.gz">https://caml.inria.fr/pub/distrib/ocaml-4.14/ocaml-4.14.0.tar.gz</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">ocaml-in-python.0.1.0: Effortless Python bindings for OCaml modules</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-in-python-0-1-0-effortless-python-bindings-for-ocaml-modules/9603/1">https://discuss.ocaml.org/t/ann-ocaml-in-python-0-1-0-effortless-python-bindings-for-ocaml-modules/9603/1</a>
</p>
</div>
