2022.03.29.org
** Thierry Martinez announced


I am happy to announce the first release of ~ocaml-in-python~: this is a Python package that exposes all OCaml
modules as Python libraries, generating bindings on the fly. This can be seen as a dual of
[[https://discuss.ocaml.org/t/ann-pyml-bindgen-a-cli-app-to-generate-python-bindings-directly-from-ocaml-value-specifications/8786][~pyml_bindgen~]]:
~pyml_bindgen~ binds Python libraries in OCaml, while ~ocaml-in-python~ binds OCaml modules in Python.

It is available from [[https://github.com/thierry-martinez/ocaml-in-python][GitHub]] or *via* ~opam~: ~opam install
ocaml-in-python~

Requirements: ~OCaml~ >= 4.13, ~Python~ >= 3.7.

Once installed *via* ~opam~, the package should be registered in the Python environment:

- either by registering the package with ~pip~ using the following command (requires Python >=3.8):
  #+begin_src shell
  pip install --editable "`opam var ocaml-in-python:lib`"
  #+end_src
- or by adding the following definition to the environment:
  #+begin_src shell
  export PYTHONPATH="`opam var share`/python/:$PYTHONPATH"
  #+end_src

Then, we can ~import ocaml~ in Python and use OCaml modules:
#+begin_src python
Python 3.10.0 (default, Nov 10 2021, 19:16:14) [GCC 7.5.0] on linux
Type "help", "copyright", "credits" or "license" for more information.
>>> import ocaml
>>> print(ocaml.List.map((lambda x : x + 1), [1, 2, 3]))
[2;3;4]
#+end_src

We can for instance compile an OCaml module on the fly from Python.
#+begin_src python
>>> m = ocaml.compile('let hello x = Printf.printf "Hello, %s!\n%!" x')
>>> m.hello('world')
Hello, world!
#+end_src

And we can require and use packages /via/ ~findlib~.
#+begin_src python
>>> ocaml.require("parmap")
>>> from ocaml import Parmap
>>> print(Parmap.parmap(
...   (lambda x : x + 1), Parmap.A([1, 2, 3]), ncores=2))
[2;3;4]
#+end_src

Details about the conversions are given in
[[https://github.com/thierry-martinez/ocaml-in-python/blob/main/README.md][~README.md~]].

Happy hacking!
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
