2022.03.29.html

<div id="outline-container-orgb380a45" class="outline-3">
<h3 id="orgb380a45">Thierry Martinez announced</h3>
<div class="outline-text-3" id="text-orgb380a45">
<p>
I am happy to announce the first release of <code>ocaml-in-python</code>: this is a Python package that exposes all OCaml
modules as Python libraries, generating bindings on the fly. This can be seen as a dual of
<a href="https://discuss.ocaml.org/t/ann-pyml-bindgen-a-cli-app-to-generate-python-bindings-directly-from-ocaml-value-specifications/8786"><code>pyml_bindgen</code></a>:
<code>pyml_bindgen</code> binds Python libraries in OCaml, while <code>ocaml-in-python</code> binds OCaml modules in Python.
</p>

<p>
It is available from <a href="https://github.com/thierry-martinez/ocaml-in-python">GitHub</a> or <b>via</b> <code>opam</code>: <code>opam install
ocaml-in-python</code>
</p>

<p>
Requirements: <code>OCaml</code> &gt;= 4.13, <code>Python</code> &gt;= 3.7.
</p>

<p>
Once installed <b>via</b> <code>opam</code>, the package should be registered in the Python environment:
</p>

<ul class="org-ul">
<li><p>
either by registering the package with <code>pip</code> using the following command (requires Python &gt;=3.8):
</p>
<div class="org-src-container">
<pre class="src src-shell">pip install --editable <span style="color: #8b2252;">"`opam var ocaml-in-python:lib`"</span>
</pre>
</div></li>
<li><p>
or by adding the following definition to the environment:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #483d8b;">export</span> <span style="color: #a0522d;">PYTHONPATH</span>=<span style="color: #8b2252;">"`opam var share`/python/:$PYTHONPATH"</span>
</pre>
</div></li>
</ul>

<p>
Then, we can <code>import ocaml</code> in Python and use OCaml modules:
</p>
<div class="org-src-container">
<pre class="src src-python">Python 3.10.0 (default, Nov 10 2021, 19:16:14) [GCC 7.5.0] on linux
Type <span style="color: #8b2252;">"help"</span>, <span style="color: #8b2252;">"copyright"</span>, <span style="color: #8b2252;">"credits"</span> <span style="color: #a020f0;">or</span> <span style="color: #8b2252;">"license"</span> <span style="color: #a020f0;">for</span> more information.
&gt;&gt;&gt; <span style="color: #a020f0;">import</span> ocaml
&gt;&gt;&gt; <span style="color: #a020f0;">print</span>(ocaml.List.<span style="color: #483d8b;">map</span>((<span style="color: #a020f0;">lambda</span> x : x + 1), [1, 2, 3]))
[2;3;4]
</pre>
</div>

<p>
We can for instance compile an OCaml module on the fly from Python.
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a0522d;">m</span> = ocaml.<span style="color: #483d8b;">compile</span>(<span style="color: #8b2252;">'let hello x = Printf.printf "Hello, %s!\n%!" x'</span>)
&gt;&gt;&gt; m.hello(<span style="color: #8b2252;">'world'</span>)
Hello, world!
</pre>
</div>

<p>
And we can require and use packages <i>via</i> <code>findlib</code>.
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; ocaml.require(<span style="color: #8b2252;">"parmap"</span>)
&gt;&gt;&gt; <span style="color: #a020f0;">from</span> ocaml <span style="color: #a020f0;">import</span> Parmap
&gt;&gt;&gt; <span style="color: #a020f0;">print</span>(Parmap.parmap(
...   (<span style="color: #a020f0;">lambda</span> x : x + 1), Parmap.A([1, 2, 3]), ncores=2))
[2;3;4]
</pre>
</div>

<p>
Details about the conversions are given in
<a href="https://github.com/thierry-martinez/ocaml-in-python/blob/main/README.md"><code>README.md</code></a>.
</p>

<p>
Happy hacking!
</p>
</div>
</div>
</div>




<div id="outline-container-orgfc5addb" class="outline-2">
<h2 id="orgfc5addb">Old CWN</h2>
<div class="outline-text-2" id="text-orgfc5addb">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="org3a0c4d9">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
